
            [
        {
            "title": "The Poppy War",
            "author": "R.F. Kuang",
            "war_conflict": "Second Sino-Japanese War and Chinese Civil War",
            "war_period": "1937–1945; 1927–1949",
            "genre": "Military Fantasy",
            "country": "China",
            "photo": "poppywar",
            "purchase_link": "https://www.amazon.com/s?k=The+Poppy+War",
            "synopsis": "'The Poppy War' by R.F. Kuang is a military fantasy that unfolds against the backdrop of Second Sino-Japanese War and Chinese Civil War. Set in China, it explores the human spirit amid turmoil — weaving themes of sacrifice, courage, and the enduring impact of war on individuals and societies.",
            "description": "In a China torn apart by the Second Sino-Japanese War and the Chinese Civil War, a war orphan named Rin escapes a life of poverty when she earns a place at the prestigious Sinegard Academy. There, she discovers an aptitude for the nearly forgotten art of shamanism and learns that her powers may be the key to saving her people—or destroying them. As political tensions escalate into brutal conflict, Rin must decide how far she is willing to go, and what she is willing to sacrifice, to achieve victory."
        },
        {
            "title": "Outlander",
            "author": "Diana Gabaldon",
            "war_conflict": "Jacobite Rising (1745)",
            "war_period": "1745–1746",
            "genre": "Historical Romance with Time Travel",
            "country": "Scotland",
            "photo": "dianagabaldon",
            "purchase_link": "https://www.amazon.com/Outlander-Diana-Gabaldon/dp/0385319959/ref=sr_1_1?crid=6WOE1OGCJLEG&dib=eyJ2IjoiMSJ9.f0h6YNFdbT7DxdB5Msl9oCM14If8f-my5eYZhhPMbQkOdtsBkOKVtn5GxS9A0A0ibX7FGddCkx8d7cFzZ0NNx0WG7PyMXEbWoYfJPhiYQ5JZSDrNAnW1m8P9v3EmDKGNqGcc0HcqBfNd0Ocitxp9ne-CSE8joOhg4OLWtrn5md1iGeWdk7-ENrnIh0p-hlxLCNxbZVI1DiiC-vuivqWVJ-ZiJYixp_H-Jt7Y6PowO_o.M2DhQ2DN4O2gNv0qDNyDjABbxW-IS0vlXVG8wDZKmgM&dib_tag=se&keywords=Outlander+book&qid=1755009800&sprefix=outlander+book%2Caps%2C282&sr=8-1",
            "synopsis": "'Outlander' by Diana Gabaldon is a historical romance with time travel that unfolds against the backdrop of Jacobite Rising (1745). Set in Scotland, it explores the human spirit amid turmoil — weaving themes of sacrifice, courage, and the enduring impact of war on individuals and societies.",
            "description": "Claire Randall, a former combat nurse in 1945, is on a second honeymoon in Scotland when she is inexplicably swept back in time to 1743, into a world torn by the Jacobite Rising. Caught between her own time and a past filled with danger, political intrigue, and forbidden love, Claire must navigate her new reality and the loyalties of her heart while finding a way to survive."
        },
        {
            "title": "His Majesty’s Dragon",
            "author": "Naomi Novik",
            "war_conflict": "Napoleonic Wars",
            "war_period": "1803–1815",
            "genre": "Military Fantasy with Dragons",
            "country": "Europe",
            "photo": "hismajestydragon",
            "purchase_link": "https://www.amazon.com/s?k=His+Majesty’s+Dragon",
            "synopsis": "'His Majesty’s Dragon' by Naomi Novik is a military fantasy with dragons that unfolds against the backdrop of Napoleonic Wars. Set in Europe, it explores the human spirit amid turmoil — weaving themes of sacrifice, courage, and the enduring impact of war on individuals and societies.",
            "description": "During the Napoleonic Wars, Captain Will Laurence captures an enemy ship and discovers an unhatched dragon egg on board. When the dragon, Temeraire, hatches and bonds with Laurence, the captain’s life changes forever. Drawn into Britain’s Aerial Corps, man and dragon must forge a partnership strong enough to face the perils of war in the skies."
        },
        {
            "title": "Jonathan Strange & Mr Norrell",
            "author": "Susanna Clarke",
            "war_conflict": "Napoleonic Wars",
            "war_period": "1803–1815",
            "genre": "Historical Fantasy",
            "country": "Europe",
            "photo": "susanaclarke",
            "purchase_link": "https://www.amazon.com/Jonathan-Strange-Mr-Norrell-Novel/dp/1635576725/ref=sr_1_1?dib=eyJ2IjoiMSJ9.KCPa7ByYbQtfBffLYh0KlnpPAZBknmF3W7PfawH2S5SROoAr6c3WRZcDwcpYX4lXNLsX9TcQo1N_NMi1wla2p72ONAMntd6grVW0bnLoSquWXGUt2ETY9xW0hxFS-w6Pe7AZZHQbME3hQ4kedNgKoD07RZI0p0UZyUVUB7dYoyG_qgysLUQ89qojDeuSqhYtB0KXsZtYqXWyMyoijaGeSBYf8VE-TE4Gw-ArYJCS9qo.g91VqRzh-GslsNKYVevnbpRoepvJAvL8ebHpq8VFr3E&dib_tag=se&keywords=Jonathan+Strange&qid=1755009970&sr=8-1",
            "synopsis": "'Jonathan Strange & Mr Norrell' by Susanna Clarke is a historical fantasy that unfolds against the backdrop of Napoleonic Wars. Set in Europe, it explores the human spirit amid turmoil — weaving themes of sacrifice, courage, and the enduring impact of war on individuals and societies.",
            "description": "In an alternate 19th-century England where magic is real but fading, two magicians—Jonathan Strange and Mr Norrell—emerge to restore it to the land. Set against the backdrop of the Napoleonic Wars, their alliance soon turns into rivalry as they explore the limits of magic, challenge the boundaries of society, and uncover secrets with the power to alter history."
        },
        {
            "title": "The Lions of Al-Rassan",
            "author": "Guy Gavriel Kay",
            "war_conflict": "Reconquista of the Iberian Peninsula",
            "war_period": "711–1492",
            "genre": "Historical Fantasy",
            "country": "Spain/Pt",
            "photo": "lionsofALrassan",
            "purchase_link": "https://www.amazon.com/s?k=The+Lions+of+Al-Rassan",
            "synopsis": "'The Lions of Al-Rassan' by Guy Gavriel Kay is a historical fantasy that unfolds against the backdrop of Reconquista of the Iberian Peninsula. Set in Spain/Portugal, it explores the human spirit amid turmoil — weaving themes of sacrifice, courage, and the enduring impact of war on individuals and societies.",
            "description": "In the medieval kingdoms of the Iberian Peninsula during the Reconquista, political and religious tensions shape the fates of warriors, poets, and rulers. Amid the shifting alliances between Christian and Muslim realms, two former enemies—Ammar ibn Khairan, a poet and assassin, and Rodrigo Belmonte, a military commander—are drawn into a web of loyalty, betrayal, and love that will change their lives and their world."
        },
        {
            "title": "A Song of Ice and Fire",
            "author": "George R.R. Martin",
            "war_conflict": "Wars of the Roses (1455–1487)",
            "war_period": "1455–1487",
            "genre": "Epic Fantasy",
            "country": "England",
            "photo": "georgeRRmartin",
            "purchase_link": "https://www.amazon.com/s?k=A+Song+of+Ice+and+Fire",
            "synopsis": "'A Song of Ice and Fire' by George R.R. Martin is a epic fantasy that unfolds against the backdrop of Wars of the Roses (1455–1487). Set in England, it explores the human spirit amid turmoil — weaving themes of sacrifice, courage, and the enduring impact of war on individuals and societies.",
            "description": "In a realm where noble houses vie for power, the struggle for the Iron Throne erupts into a sprawling conflict inspired by the Wars of the Roses. Across continents and cultures, kings, queens, knights, and outcasts become entangled in webs of loyalty and betrayal. As ancient forces stir beyond the Wall and dragons return to the skies, the fate of the realm hangs in the balance."
        },
        {
            "title": "The War of the Flowers",
            "author": "Tad Williams",
            "war_conflict": "Inspired by the Vietnam War",
            "war_period": "1955–1975",
            "genre": "Urban Fantasy",
            "country": "Vietnam",
            "photo": "tadwillians",
            "purchase_link": "https://www.amazon.com/s?k=The+War+of+the+Flowers",
            "synopsis": "'The War of the Flowers' by Tad Williams is a urban fantasy that unfolds against the backdrop of Inspired by the Vietnam War. Set in Vietnam, it explores the human spirit amid turmoil — weaving themes of sacrifice, courage, and the enduring impact of war on individuals and societies.",
            "description": "Theo Vilmos, a struggling rock singer, stumbles into the world of the fae after inheriting an old house and discovering a mysterious manuscript. Drawn into a land of strange beauty and deadly politics, Theo must navigate dangerous alliances and confront truths about his own family while a war—both magical and all too human—brews in the background."
        },
        {
            "title": "The City of Brass",
            "author": "S.A. Chakraborty",
            "war_conflict": "Historical tensions in the Middle East (Ottoman era)",
            "war_period": "16th–18th centuries",
            "genre": "Historical Fantasy",
            "country": "Middle East",
            "photo": "cityofbrass",
            "purchase_link": "https://www.amazon.com/s?k=The+City+of+Brass",
            "synopsis": "'The City of Brass' by S.A. Chakraborty is a historical fantasy that unfolds against the backdrop of Historical tensions in the Middle East (Ottoman era). Set in Middle East, it explores the human spirit amid turmoil — weaving themes of sacrifice, courage, and the enduring impact of war on individuals and societies.",
           "description": "In 18th-century Cairo, Nahri survives as a con artist, tricking Ottoman nobles with her skills as a healer—until she accidentally summons a djinn warrior. Swept into the legendary city of Daevabad, Nahri becomes entangled in ancient rivalries and political intrigue. As she learns the truth about her heritage, she must decide where her loyalties lie in a city on the brink of war."
        },
        {
            "title": "Black Company Series",
            "author": "Glen Cook",
            "war_conflict": "Inspired by the Vietnam War",
            "war_period": "1955–1975",
            "genre": "Military Fantasy",
            "country": "Vietnam",
            "photo": "glencook",
            "purchase_link": "https://www.amazon.com/s?k=Black+Company+Series",
            "synopsis": "'Black Company Series' by Glen Cook is a military fantasy that unfolds against the backdrop of Inspired by the Vietnam War. Set in Vietnam, it explores the human spirit amid turmoil — weaving themes of sacrifice, courage, and the enduring impact of war on individuals and societies.",
            "description": "The Black Company, a band of elite mercenaries, sells its services to the highest bidder in a world where magic and war are inseparable. Bound by a contract to serve a mysterious and dangerous sorceress known as the Lady, the Company faces brutal battles, shifting allegiances, and the moral costs of survival in a land torn apart by rebellion."
        },
        {
            "title": "Stormdancer",
            "author": "Jay Kristoff",
            "war_conflict": "Feudal Japan conflicts (Sengoku period)",
            "war_period": "1467–1615",
            "genre": "Steampunk Fantasy",
            "country": "Japan",
            "photo": "stormdancer",
            "purchase_link": "https://www.amazon.com/s?k=Stormdancer",
            "synopsis": "'Stormdancer' by Jay Kristoff is a steampunk fantasy that unfolds against the backdrop of Feudal Japan conflicts (Sengoku period). Set in Japan, it explores the human spirit amid turmoil — weaving themes of sacrifice, courage, and the enduring impact of war on individuals and societies.",
            "description": "In an alternate steampunk version of feudal Japan, the Shima Imperium is dying, poisoned by its own industrial expansion. When the Shōgun commands the capture of a mythical arashitora, or thunder tiger, young huntress Yukiko and her father set out on a perilous journey. What they find will challenge the empire’s destiny and spark a rebellion."
        },
        {
            "title": "The Misplaced Legion",
            "author": "Harry Turtledove",
            "war_conflict": "Roman Empire wars",
            "war_period": "1st century BCE–5th century CE",
            "genre": "Historical Fantasy",
            "country": "Roman Empire",
            "photo": "themisplacedlegion",
            "purchase_link": "https://www.amazon.com/s?k=The+Misplaced+Legion",
            "synopsis": "'The Misplaced Legion' by Harry Turtledove is a historical fantasy that unfolds against the backdrop of Roman Empire wars. Set in Roman Empire, it explores the human spirit amid turmoil — weaving themes of sacrifice, courage, and the enduring impact of war on individuals and societies.",
            "description": "When Roman soldiers of the fabled Tenth Legion are mysteriously transported through time, they find themselves in an alternate world where history took a different path. Stranded far from home, they are caught between warring powers and must decide whether to carve out a place for themselves in this strange new land or perish in the conflicts around them."
        },
        {
            "title": "The Winter King",
            "author": "Bernard Cornwell",
            "war_conflict": "Saxon invasions of Britain",
            "war_period": "c. 450–600",
            "genre": "Historical Novel with Arthurian Myths",
            "country": "Britain",
            "photo": "bernardcornwell",
            "purchase_link": "https://www.amazon.com/s?k=The+Winter+King",
            "synopsis": "'The Winter King' by Bernard Cornwell is a historical novel with arthurian myths that unfolds against the backdrop of Saxon invasions of Britain. Set in Britain, it explores the human spirit amid turmoil — weaving themes of sacrifice, courage, and the enduring impact of war on individuals and societies.",
            "description": "In post-Roman Britain, young warrior Derfel Cadarn recalls the days when he served under the legendary Arthur. As Saxon invaders press upon the land, Arthur seeks to unite the fractured kingdoms, while facing betrayal from within and the fading light of the old gods. Against this backdrop, love, loyalty, and war intertwine in a retelling of the Arthurian legends."
        },
        {
            "title": "All Quiet on the Western Front",
            "author": "Erich Maria Remarque",
            "war_conflict": "World War I (Western Front)",
            "war_period": "1914–1918",
            "genre": "War Novel",
            "country": "France/Belgium",
            "photo": "erichmaria",
            "purchase_link": "https://www.amazon.com/s?k=All+Quiet+on+the+Western+Front",
            "synopsis": "'All Quiet on the Western Front' by Erich Maria Remarque is a war novel that unfolds against the backdrop of World War I (Western Front). Set in France/Belgium, it explores the human spirit amid turmoil — weaving themes of sacrifice, courage, and the enduring impact of war on individuals and societies.",
            "description": "Paul Bäumer, a young German soldier in World War I, tells of life and death on the Western Front. Through harrowing battles, fleeting moments of camaraderie, and the numbing routine of survival, Paul and his comrades face the crushing reality of a war that strips them of youth, hope, and humanity."
        },
        {
            "title": "The Book Thief",
            "author": "Markus Zusak",
            "war_conflict": "World War II",
            "war_period": "1939–1945",
            "genre": "Historical Drama",
            "country": "Germany",
            "photo": "thebookthief",
            "purchase_link": "https://www.amazon.com/s?k=The+Book+Thief",
            "synopsis": "'The Book Thief' by Markus Zusak is a historical drama that unfolds against the backdrop of World War II. Set in Germany, it explores the human spirit amid turmoil — weaving themes of sacrifice, courage, and the enduring impact of war on individuals and societies.",
            "description": "In Nazi Germany, young Liesel Meminger steals books to sustain herself in a world filled with fear and loss. Living with her foster parents, she shares her stolen treasures with neighbors and a Jewish man hiding in their basement. Narrated by Death, this story reveals the power of words to inspire hope and endure even in the darkest of times."
        },
        {
            "title": "Catch-22",
            "author": "Joseph Heller",
            "war_conflict": "World War II (Mediterranean Theater)",
            "war_period": "1939–1945",
            "genre": "Military Satire",
            "country": "Italy",
            "photo": "catch22",
            "purchase_link": "https://www.amazon.com/s?k=Catch-22",
            "synopsis": "'Catch-22' by Joseph Heller is a military satire that unfolds against the backdrop of World War II (Mediterranean Theater). Set in Italy, it explores the human spirit amid turmoil — weaving themes of sacrifice, courage, and the enduring impact of war on individuals and societies.",
            "description": "During World War II in the Mediterranean Theater, Captain John Yossarian serves as a U.S. Army Air Forces bombardier who is desperate to survive the war. Trapped by the absurdity of military bureaucracy—embodied in the infamous Catch-22 rule—Yossarian confronts the madness of combat, authority, and the fragile line between sanity and survival."
        },
        {
            "title": "Suite Française",
            "author": "Irène Némirovsky",
            "war_conflict": "World War II (Fall of France and Occupation)",
            "war_period": "1939–1945",
            "genre": "Historical Novel",
            "country": "France",
            "photo": "suitefran",
            "purchase_link": "https://www.amazon.com/s?k=Suite+Française",
            "synopsis": "'Suite Française' by Irène Némirovsky is a historical novel that unfolds against the backdrop of World War II (Fall of France and Occupation). Set in France, it explores the human spirit amid turmoil — weaving themes of sacrifice, courage, and the enduring impact of war on individuals and societies.",
            "description": "In the midst of World War II, as France falls and occupation begins, the lives of ordinary people are upended. From the chaos of fleeing refugees to the quiet endurance of those left behind, intertwined stories reveal the human cost of war, the resilience of love, and the complex moral choices forced upon a nation under siege."
        },
        {
            "title": "Birdsong",
            "author": "Sebastian Faulks",
            "war_conflict": "World War I (Somme and tunnels)",
            "war_period": "1914–1918",
            "genre": "War and Romance Novel",
            "country": "France",
            "photo": "birdsong",
            "purchase_link": "https://www.amazon.com/s?k=Birdsong",
            "synopsis": "'Birdsong' by Sebastian Faulks is a war and romance novel that unfolds against the backdrop of World War I (Somme and tunnels). Set in France, it explores the human spirit amid turmoil — weaving themes of sacrifice, courage, and the enduring impact of war on individuals and societies.",
            "description": "Stephen Wraysford’s life changes forever when he falls in love during a trip to France before World War I. Years later, he finds himself in the trenches of the Somme, enduring unimaginable horrors. Moving between past and present, his story weaves together passion, loss, and the enduring scars left by war."
        },
        {
            "title": "Matterhorn",
            "author": "Karl Marlantes",
            "war_conflict": "Vietnam War",
            "war_period": "1955–1975",
            "genre": "Military Novel",
            "country": "Vietnam",
            "photo": "matterhorn",
            "purchase_link": "https://www.amazon.com/s?k=Matterhorn",
            "synopsis": "'Matterhorn' by Karl Marlantes is a military novel that unfolds against the backdrop of Vietnam War. Set in Vietnam, it explores the human spirit amid turmoil — weaving themes of sacrifice, courage, and the enduring impact of war on individuals and societies.",
            "description": "In the jungles of Vietnam, young Lieutenant Waino Mellas joins a company of Marines tasked with holding a remote hill. As the soldiers face brutal conditions, shifting orders, and the constant threat of death, their bonds and sanity are tested in a battle as much against the elements as against the enemy."
        },
        {
            "title": "The Things They Carried",
            "author": "Tim O’Brien",
            "war_conflict": "Vietnam War",
            "war_period": "1955–1975",
            "genre": "War Short Stories",
            "country": "Vietnam",
            "photo": "thethingstheycarried",
            "purchase_link": "https://www.amazon.com/s?k=The+Things+They+Carried",
            "synopsis": "'The Things They Carried' by Tim O’Brien is a war short stories that unfolds against the backdrop of Vietnam War. Set in Vietnam, it explores the human spirit amid turmoil — weaving themes of sacrifice, courage, and the enduring impact of war on individuals and societies.",
            "description": "Through a series of interconnected short stories, Tim O’Brien blends fact and fiction to portray the Vietnam War. Following a platoon of American soldiers, he captures the physical burdens they carry—both literal and emotional—and the lasting impact of combat on memory, identity, and the truth of storytelling itself."
        },
        {
            "title": "For Whom the Bell Tolls",
            "author": "Ernest Hemingway",
            "war_conflict": "Spanish Civil War",
            "war_period": "1936–1939",
            "genre": "War Novel",
            "country": "Spain",
            "photo": "ernesthemingway",
            "purchase_link": "https://www.amazon.com/s?k=For+Whom+the+Bell+Tolls",
            "synopsis": "'For Whom the Bell Tolls' by Ernest Hemingway is a war novel that unfolds against the backdrop of Spanish Civil War. Set in Spain, it explores the human spirit amid turmoil — weaving themes of sacrifice, courage, and the enduring impact of war on individuals and societies.",
            "description": "American volunteer Robert Jordan joins a band of guerrilla fighters during the Spanish Civil War with a mission to blow up a strategic bridge. Over the course of three days, he faces love, loyalty, and the inevitability of sacrifice, knowing that the success of the mission may cost him his life."
        },
        {
            "title": "The Nightingale",
            "author": "Kristin Hannah",
            "war_conflict": "World War II (Occupation of France)",
            "war_period": "1939–1945",
            "genre": "Historical Novel",
            "country": "France",
            "photo": "thenightgale",
            "purchase_link": "https://www.amazon.com/s?k=The+Nightingale",
            "synopsis": "'The Nightingale' by Kristin Hannah is a historical novel that unfolds against the backdrop of World War II (Occupation of France). Set in France, it explores the human spirit amid turmoil — weaving themes of sacrifice, courage, and the enduring impact of war on individuals and societies.",
            "description": "In Nazi-occupied France, two sisters—Vianne and Isabelle—take very different paths to resist the German occupation. One fights quietly to protect her family and neighbors, while the other joins the Resistance, risking her life to save others. Their courage and sacrifices shape a story of survival, love, and the enduring strength of family."
        },
        {
            "title": "War and Peace",
            "author": "Leo Tolstoy",
            "war_conflict": "Napoleonic Wars (French invasion of Russia)",
            "war_period": "1803–1815 (Russia: 1812)",
            "genre": "Epic Novel",
            "country": "Russia",
            "photo": "warandpeace",
            "purchase_link": "https://www.amazon.com/s?k=War+and+Peace",
            "synopsis": "'War and Peace' by Leo Tolstoy is a epic novel that unfolds against the backdrop of Napoleonic Wars (French invasion of Russia). Set in Russia, it explores the human spirit amid turmoil — weaving themes of sacrifice, courage, and the enduring impact of war on individuals and societies.",
            "description": "Spanning the Napoleonic Wars and the French invasion of Russia, this sweeping epic follows the intertwined lives of aristocratic families. As love affairs, rivalries, and philosophical debates unfold, the brutal realities of war reshape destinies and challenge the values of an entire generation."
        },
        {
            "title": "The Sympathizer",
            "author": "Viet Thanh Nguyen",
            "war_conflict": "Vietnam War and post-war diaspora",
            "war_period": "1955–1975 (aftermath into late 1970s)",
            "genre": "Espionage",
            "country": "Vietnam/USA",
            "photo": "thesimpatizer",
            "purchase_link": "https://www.amazon.com/s?k=The+Sympathizer",
            "synopsis": "'The Sympathizer' by Viet Thanh Nguyen is a espionage that unfolds against the backdrop of Vietnam War and post-war diaspora. Set in Vietnam/USA, it explores the human spirit amid turmoil — weaving themes of sacrifice, courage, and the enduring impact of war on individuals and societies.",
            "description": "A North Vietnamese double agent, living among the South Vietnamese exile community in the United States, wrestles with divided loyalties after the fall of Saigon. As he reports to his Communist superiors, he becomes entangled in espionage, political upheaval, and the search for his own identity in a fractured world."
        },
        {
            "title": "Life and Fate",
            "author": "Vasily Grossman",
            "war_conflict": "World War II (Battle of Stalingrad)",
            "war_period": "1942–1943",
            "genre": "Epic Novel",
            "country": "Russia",
            "photo": "vasilygrossman",
            "purchase_link": "https://www.amazon.com/s?k=Life+and+Fate",
            "synopsis": "'Life and Fate' by Vasily Grossman is a epic novel that unfolds against the backdrop of World War II (Battle of Stalingrad). Set in Russia, it explores the human spirit amid turmoil — weaving themes of sacrifice, courage, and the enduring impact of war on individuals and societies.",
            "description": "Set during the Battle of Stalingrad, this epic novel follows Soviet soldiers, civilians, and political officers as they endure one of the most devastating sieges in history. Amid the brutality, acts of humanity emerge, offering glimpses of hope in a world consumed by war."
        },
        {
            "title": "The Painted Bird",
            "author": "Jerzy Kosinski",
            "war_conflict": "World War II",
            "war_period": "1939–1945",
            "genre": "Dramatic Novel",
            "country": "Poland",
            "photo": "paintedbird",
            "purchase_link": "https://www.amazon.com/s?k=The+Painted+Bird",
            "synopsis": "'The Painted Bird' by Jerzy Kosinski is a dramatic novel that unfolds against the backdrop of World War II. Set in Poland, it explores the human spirit amid turmoil — weaving themes of sacrifice, courage, and the enduring impact of war on individuals and societies.",
            "description": "A young boy wanders through Eastern Europe during World War II, witnessing acts of cruelty and violence that strip away innocence. Moving from village to village, he faces the darkest sides of human nature, as survival becomes his only goal in a landscape marked by fear and destruction."
        },
        {
            "title": "The Kite Runner",
            "author": "Khaled Hosseini",
            "war_conflict": "Soviet–Afghan War",
            "war_period": "1979–1989",
            "genre": "Historical Drama",
            "country": "Afghanistan",
            "photo": "kitrunner",
            "purchase_link": "https://www.amazon.com/s?k=The+Kite+Runner",
            "synopsis": "'The Kite Runner' by Khaled Hosseini is a historical drama that unfolds against the backdrop of Soviet–Afghan War. Set in Afghanistan, it explores the human spirit amid turmoil — weaving themes of sacrifice, courage, and the enduring impact of war on individuals and societies.",
            "description": "In a changing Afghanistan, two boys—Amir, the privileged son of a wealthy merchant, and Hassan, the son of his father’s servant—share a deep bond that is tested by betrayal. Years later, during the Soviet–Afghan War, Amir returns to a homeland in turmoil, seeking redemption and confronting the haunting memories of his past."
        },
        {
            "title": "O Tempo e o Vento",
            "author": "Erico Verissimo",
            "war_conflict": "Ragamuffin War and Federalist Revolution",
            "war_period": "1835–1845; 1893–1895",
            "genre": "Brazilian Historical Novel",
            "country": "Brazil",
            "photo": "otempoeovento",
            "purchase_link": "https://www.amazon.com.br/s?k=O+Tempo+e+o+Vento",
            "synopsis": "'O Tempo e o Vento' by Erico Verissimo is a brazilian historical novel that unfolds against the backdrop of Ragamuffin War and Federalist Revolution. Set in Brazil, it explores the human spirit amid turmoil — weaving themes of sacrifice, courage, and the enduring impact of war on individuals and societies.",
            "description": "Spanning generations, this Brazilian epic chronicles the fortunes of the Terra Cambará family during the Ragamuffin War and the Federalist Revolution. Against the backdrop of political upheaval and shifting alliances, personal dramas unfold, reflecting the turbulent history of southern Brazil."
        },

        {
            "title": "Guerra no Bom Fim",
            "author": "Moacyr Scliar",
            "war_conflict": "World War II (home front in Brazil)",
            "war_period": "1939–1945",
            "genre": "Brazilian Historical Novel",
            "country": "Brazil",
            "photo": "bomfim",
            "purchase_link": "https://www.amazon.com.br/s?k=Guerra+do+Bom+Fim",
            "synopsis": "'Guerra do Bom Fim' by Moacyr Scliar is a brazilian historical novel that unfolds against the backdrop of World War II (home front in Brazil). Set in Brazil, it explores the human spirit amid turmoil — weaving themes of sacrifice, courage, and the enduring impact of war on individuals and societies.",
            "description": "In Porto Alegre’s Bom Fim neighborhood during World War II, Jewish and non-Jewish residents navigate daily life far from the frontlines but deeply affected by the conflict. Through humor, memory, and loss, the story captures a portrait of a unique community in a turbulent era."
        },
        {
            "title": "Capitães da Areia",
            "author": "Jorge Amado",
            "war_conflict": "Brazil before World War II",
            "war_period": "1930s",
            "genre": "Social Novel",
            "country": "Brazil",
            "photo": "capitaesdeareia",
            "purchase_link": "https://www.amazon.com.br/s?k=Capitães+da+Areia",
            "synopsis": "'Capitães da Areia' by Jorge Amado is a social novel that unfolds against the backdrop of Brazil before World War II. Set in Brazil, it explores the human spirit amid turmoil — weaving themes of sacrifice, courage, and the enduring impact of war on individuals and societies.",
            "description": "In 1930s Salvador, a gang of street children known as the Captains of the Sand survive by stealing and dreaming of freedom. As they navigate poverty, crime, and fleeting moments of kindness, their lives reveal the resilience and fragility of youth in a world indifferent to their struggles."
        },
        {
            "title": "Os Sertões",
            "author": "Euclides da Cunha",
            "war_conflict": "War of Canudos",
            "war_period": "1896–1897",
            "genre": "Historical Narrative",
            "country": "Brazil",
            "photo": "ossertoes",
            "purchase_link": "https://www.amazon.com.br/s?k=Os+Sertões",
            "synopsis": "'Os Sertões' by Euclides da Cunha is a historical narrative that unfolds against the backdrop of War of Canudos. Set in Brazil, it explores the human spirit amid turmoil — weaving themes of sacrifice, courage, and the enduring impact of war on individuals and societies.",
            "description": "A landmark work of Brazilian literature, this historical narrative recounts the War of Canudos in the arid backlands of Bahia. Blending reportage and analysis, it follows the rise and fall of a messianic leader and his followers, examining the clash between the Brazilian state and a marginalized community."
        },
        {
            "title": "O Louco do Cati",
            "author": "Dyonélio Machado",
            "war_conflict": "Brazilian Revolution of 1930",
            "war_period": "1930",
            "genre": "Historical Novel",
            "country": "Brazil",
            "photo": "oloucodocati",
            "purchase_link": "https://www.amazon.com.br/s?k=O+Louco+do+Cati",
            "synopsis": "'O Louco do Cati' by Dyonélio Machado is a historical novel that unfolds against the backdrop of Brazilian Revolution of 1930. Set in Brazil, it explores the human spirit amid turmoil — weaving themes of sacrifice, courage, and the enduring impact of war on individuals and societies.",
            "description": "In the rural heartlands of Brazil, the Louco do Cati is a man whose eccentric life unfolds against the backdrop of local politics and the events leading to the 1930 Revolution. Through his experiences, the novel explores themes of identity, community, and the impact of national change on individual lives."
        }
    ]